############################ Tuple ####################################
# تاپل ها قابلیت آپدیت شدن ندارند لذا توابعی که باعث تغییر تاپل می شوند را نمی توان استفاده کرد.
# مانند حذف کردن، اضافه کردن و ...

myTuple = (8, 4, 12, 1, 8)

# برای دسترسی به اعضای یک Tuple به صورت زیر عمل میکنیم
print(myTuple[2])  # 12

# برای به دست آوردن تعداد item های یک Tuple از تابع len استفاده می کنیم.
print(len(myTuple))  # 5

# index() returns the lowest index (first appears) in Tuple that value appears.
# مثال زیر position اولین جایی که عدد 4 را می بیند یه ما برمی گرداند.
print(myTuple.index(4))  # 1

# خاصیت slice: مشابه list ها می باشد.
