############################ LIST ####################################
myList = [2, 3, 6, 1, 4, 9, 34, 1, 8, 4, 2, 4]
# برای دسترسی به اعضای یک list به صورت زیر عمل میکنیم
print(myList[3])  # 1

# اگر بخواهیم یک item به انتهای لیست اضافه کنیم از تابع append استفاده می کنیم.
myList.append(100)
print(myList)  # [2, 3, 6, 1, 4, 9, 34, 1, 8, 4, 2, 4, 100]

# برای درج یک item در مکان دلخواه از لیست، از تابع insert استفاده می کنیم.
# Syntax --> list.insert(position, item)
myList.insert(2, 200)
print(myList)  # [2, 3, 200, 6, 1, 4, 9, 34, 1, 8, 4, 2, 4, 100]

# برای حذف یک item از داخل یک لیست از تابع remove استفاده می کنیم.
# تابع remove از ابتدای لیست شروع کرده و اولین item را که مقدار مورد نظر را دارد مشاهده کرد
# حذف کرده و به کار خود خاتمه می دهد. و همه item ها با آن مقدار را حذف نمی کند.
# Syntax --> list.remove(item)
myList.remove(4)
print(myList)  # [2, 3, 200, 6, 1, 9, 34, 1, 8, 4, 2, 4, 100]

# برای به دست آوردن تعداد تکرار یک مقدار در لیست از تابع count استفاده می کنیم.
# Syntax --> list.count(value)
# مثال زیر تعداد تکرار مقدار 1 را در لیست به ما می دهد.
valCount = myList.count(1)  # valCount = 2

# index() returns the lowest index (first appears) in list that value appears.
# مثال زیر position اولین جایی که عدد 2 را می بیند یه ما برمی گرداند.
idx = myList.index(2)  # idx = 0

# برای به دست آوردن تعداد item های یک لیست از تابع len استفاده می کنیم.
lstLen = len(myList)  # lstLen = 13

# برای ادغام دو لیست از تابع extend استفاده می کنیم.
# در مثال زیر ما دو تا لیست داریم و می خواهیم لیست دوم را به انتهای لیست اول اضافه می کنیم.
list1 = [1, 2, 3, 4]
list2 = [11, 12, 13, 14]
list1.extend(list2)
print(list1)  # [1, 2, 3, 4, 11, 12, 13, 14]

# خاصیت slice: ما می توانیم بخشی از لیست را کپی کرده و به صورت جداگانه داشته باشیم.
# نکته: همیشه عدد اول باید بزرگتر از عدد دوم باشد.
# myList[4:2] --> false

# روش اول
print(myList[0:2])  # [2, 3]
# روش دوم
# استفاده از تابع slice
# Syntax --> slice(start, end, step)
x = slice(0, 2)  # or x = slice(2)
print(myList[x])  # [2, 3]

# روش اول
print(myList[3:5])  # [6, 1]
# روش دوم
x = slice(3, 5)
print(myList[x])  # [6, 1]

print(myList[5:])  # [9, 34, 1, 8, 4, 2, 4, 100]

# نکته: ما همچنین می توانیم از اعداد منفی نیز استفاده کنیم.
# اعداد منفی از انتهای لیست شروع به شمارش میکنند.
print(myList[-8:-4])  # [9, 34, 1, 8]
